---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenFailure
source: html/4818d1b3-23bb-b38a-d595-a89948b57461.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenFailure Property

Unable to create form element

## Syntax (C#)
```csharp
public static FailureDefinitionId FormElemRegenFailure { get; }
```